Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D225CD1M.atdf
            <parameters>
              <param name="INSTANCE_ID" value="36"/>
              <param name="CLOCK_ID" value="36"/>
              <param name="DMAC_ID_RX" value="46"/>
              <param name="TCCLKS_" value="0" caption="MCK"/>
              <param name="TCCLKS_TIMER_CLOCK1" value="1" caption="GCLK"/>
              <param name="TCCLKS_TIMER_CLOCK2" value="2" caption="MCK/8"/>
              <param name="TCCLKS_TIMER_CLOCK3" value="3" caption="MCK/32"/>
              <param name="TCCLKS_TIMER_CLOCK4" value="4" caption="MCK/128"/>
              <param name="TCCLKS_TIMER_CLOCK5" value="5" caption="SLCK"/>
              <param name="TCCLKS_XC0" value="6" caption="XC0"/>
              <param name="TCCLKS_XC1" value="7" caption="XC1"/>
              <param name="TCCLKS_XC2" value="8" caption="XC2"/>
              <param name="NUM_INTERRUPT_LINES" value="1"/>
              <param name="TIMER_WIDTH" value="32"/>
            </parameters>
            <signals>
              <signal pad="PB8" function="A" group="TCLK" index="3"/>
              <signal pad="PB21" function="D" group="TCLK" index="3"/>
              <signal pad="PD31" function="D" group="TCLK" index="3"/>
              <signal pad="PA11" function="D" group="TCLK" index="4"/>
              <signal pad="PC11" function="D" group="TCLK" index="4"/>
              <signal pad="PA8" function="D" group="TCLK" index="5"/>
              <signal pad="PB30" function="D" group="TCLK" index="5"/>
              <signal pad="PB9" function="A" group="TIOA" index="3"/>
              <signal pad="PB19" function="D" group="TIOA" index="3"/>
              <signal pad="PD29" function="D" group="TIOA" index="3"/>
              <signal pad="PA9" function="D" group="TIOA" index="4"/>
              <signal pad="PC9" function="D" group="TIOA" index="4"/>
              <signal pad="PA6" function="D" group="TIOA" index="5"/>
              <signal pad="PB28" function="D" group="TIOA" index="5"/>
              <signal pad="PB10" function="A" group="TIOB" index="3"/>
              <signal pad="PB20" function="D" group="TIOB" index="3"/>
              <signal pad="PD30" function="D" group="TIOB" index="3"/>
              <signal pad="PA10" function="D" group="TIOB" index="4"/>
              <signal pad="PC10" function="D" group="TIOB" index="4"/>
              <signal pad="PA7" function="D" group="TIOB" index="5"/>
              <signal pad="PB29" function="D" group="TIOB" index="5"/>
            </signals>
          </instance>
        </module>
        <module name="TDES" id="6150" version="N">
          <instance name="TDES">
            <register-group address-space="base" name="TDES" name-in-module="TDES" offset="0xFC044000"/>
            <parameters>
              <param name="INSTANCE_ID" value="11"/>
              <param name="CLOCK_ID" value="11"/>
              <param name="DMAC_ID_TX" value="28"/>
              <param name="DMAC_ID_RX" value="29"/>
            </parameters>
          </instance>
        </module>
        <module name="TRNG" id="6334" version="K">
          <instance name="TRNG">
            <register-group address-space="base" name="TRNG" name-in-module="TRNG" offset="0xFC01C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="47"/>
              <param name="CLOCK_ID" value="47"/>
            </parameters>
          </instance>
        </module>
        <module name="TWIHS" id="11210" version="ZB">
          <instance name="TWIHS0">
            <register-group address-space="base" name="TWIHS0" name-in-module="TWIHS" offset="0xF8028000"/>
            <parameters>
              <param name="INSTANCE_ID" value="29"/>
              <param name="CLOCK_ID" value="29"/>
              <param name="DMAC_ID_TX" value="0"/>
              <param name="DMAC_ID_RX" value="1"/>
            </parameters>
            <signals>
              <signal pad="PC0" function="D" group="TWCK" index="0"/>
              <signal pad="PC28" function="E" group="TWCK" index="0"/>
              <signal pad="PD22" function="B" group="TWCK" index="0"/>
              <signal pad="PD30" function="E" group="TWCK" index="0"/>
              <signal pad="PB31" function="D" group="TWD" index="0"/>
              <signal pad="PC27" function="E" group="TWD" index="0"/>
              <signal pad="PD21" function="B" group="TWD" index="0"/>
              <signal pad="PD29" function="E" group="TWD" index="0"/>
            </signals>
          </instance>
          <instance name="TWIHS1">
            <register-group address-space="base" name="TWIHS1" name-in-module="TWIHS" offset="0xFC028000"/>
            <parameters>
              <param name="INSTANCE_ID" value="30"/>
              <param name="CLOCK_ID" value="30"/>
              <param name="DMAC_ID_TX" value="2"/>
              <param name="DMAC_ID_RX" value="3"/>
            </parameters>
            <signals>
              <signal pad="PC7" function="C" group="TWCK" index="1"/>
              <signal pad="PD5" function="A" group="TWCK" index="1"/>
              <signal pad="PD20" function="B" group="TWCK" index="1"/>
              <signal pad="PC6" function="C" group="TWD" index="1"/>
              <signal pad="PD4" function="A" group="TWD" index="1"/>
              <signal pad="PD19" function="B" group="TWD" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="UART" id="6418" version="R">
          <instance name="UART0">
            <register-group address-space="base" name="UART0" name-in-module="UART" offset="0xF801C000"/>
            <parameters>
              <param name="INSTANCE_ID" value="24"/>
              <param name="CLOCK_ID" value="24"/>
              <param name="DMAC_ID_TX" value="35"/>
              <param name="DMAC_ID_RX" value="36"/>
              <param name="BRSRCCK_PERIPH_CLK" value="0" caption="MCK"/>
              <param name="BRSRCCK_GCLK" value="0" caption="GCLK"/>
            </parameters>
            <signals>
              <signal pad="PB26" function="C" group="URXD" index="0"/>
              <signal pad="PB27" function="C" group="UTXD" index="0"/>
            </signals>
          </instance>
          <instance name="UART1">
            <register-group address-space="base" name="UART1" name-in-module="UART" offset="0xF8020000"/>
            <parameters>
              <param name="INSTANCE_ID" value="25"/>
              <param name="CLOCK_ID" value="25"/>
              <param name="DMAC_ID_TX" value="37"/>
              <param name="DMAC_ID_RX" value="38"/>
              <param name="BRSRCCK_PERIPH_CLK" value="0" caption="MCK"/>
              <param name="BRSRCCK_GCLK" value="0" caption="GCLK"/>
            </parameters>
            <signals>
              <signal pad="PC7" function="E" group="URXD" index="1"/>
              <signal pad="PD2" function="A" group="URXD" index="1"/>
              <signal pad="PC8" function="E" group="UTXD" index="1"/>
              <signal pad="PD3" function="A" group="UTXD" index="1"/>
            </signals>
          </instance>
