Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D225CD1M.atdf
    <module caption="Audio Class D Amplifier (CLASSD)" id="11283" name="CLASSD" version="G">
      <register-group name="CLASSD">
        <register caption="Control Register" name="CLASSD_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="CLASSD_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Left Channel Enable" mask="0x00000001" name="LEN"/>
          <bitfield caption="Left Channel Mute" mask="0x00000002" name="LMUTE"/>
          <bitfield caption="Right Channel Enable" mask="0x00000010" name="REN"/>
          <bitfield caption="Right Channel Mute" mask="0x00000020" name="RMUTE"/>
          <bitfield caption="PWM Modulation Type" mask="0x00000100" name="PWMTYP"/>
          <bitfield caption="Non-Overlapping Enable" mask="0x00010000" name="NON_OVERLAP"/>
          <bitfield caption="Non-Overlapping Value" mask="0x00300000" name="NOVRVAL" values="CLASSD_MR__NOVRVAL"/>
        </register>
        <register caption="Interpolator Mode Register" name="CLASSD_INTPMR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Left Channel Attenuation" mask="0x0000007F" name="ATTL"/>
          <bitfield caption="Right Channel Attenuation" mask="0x00007F00" name="ATTR"/>
          <bitfield caption="DSP Clock Frequency" mask="0x00010000" name="DSPCLKFREQ" values="CLASSD_INTPMR__DSPCLKFREQ"/>
          <bitfield caption="Enable De-emphasis Filter" mask="0x00040000" name="DEEMP" values="CLASSD_INTPMR__DEEMP"/>
          <bitfield caption="Swap Left and Right Channels" mask="0x00080000" name="SWAP" values="CLASSD_INTPMR__SWAP"/>
          <bitfield caption="CLASSD Incoming Data Sampling Frequency" mask="0x00700000" name="FRAME" values="CLASSD_INTPMR__FRAME"/>
          <bitfield caption="Equalization Selection" mask="0x0F000000" name="EQCFG" values="CLASSD_INTPMR__EQCFG"/>
          <bitfield caption="Mono Signal" mask="0x10000000" name="MONO" values="CLASSD_INTPMR__MONO"/>
          <bitfield caption="Mono Mode Selection" mask="0x60000000" name="MONOMODE" values="CLASSD_INTPMR__MONOMODE"/>
        </register>
        <register caption="Interpolator Status Register" name="CLASSD_INTSR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Configuration Error" mask="0x00000001" name="CFGERR"/>
        </register>
        <register caption="Transmit Holding Register" name="CLASSD_THR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Left Channel Data" mask="0x0000FFFF" name="LDATA"/>
          <bitfield caption="Right Channel Data" mask="0xFFFF0000" name="RDATA"/>
        </register>
        <register caption="Interrupt Enable Register" name="CLASSD_IER" offset="0x14" rw="W" size="4">
          <bitfield caption="Data Ready" mask="0x00000001" name="DATRDY"/>
        </register>
        <register caption="Interrupt Disable Register" name="CLASSD_IDR" offset="0x18" rw="W" size="4">
          <bitfield caption="Data Ready" mask="0x00000001" name="DATRDY"/>
        </register>
        <register caption="Interrupt Mask Register" name="CLASSD_IMR" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Data Ready" mask="0x00000001" name="DATRDY"/>
        </register>
        <register caption="Interrupt Status Register" name="CLASSD_ISR" offset="0x20" rw="R" size="4">
          <bitfield caption="Data Ready" mask="0x00000001" name="DATRDY"/>
        </register>
        <register caption="Write Protection Mode Register" name="CLASSD_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="CLASSD_WPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="Non-Overlapping Value" name="CLASSD_MR__NOVRVAL">
        <value caption="Non-overlapping time is 5 ns" name="_5NS" value="0x0"/>
        <value caption="Non-overlapping time is 10 ns" name="_10NS" value="0x1"/>
        <value caption="Non-overlapping time is 15 ns" name="_15NS" value="0x2"/>
        <value caption="Non-overlapping time is 20 ns" name="_20NS" value="0x3"/>
      </value-group>
      <value-group caption="DSP Clock Frequency" name="CLASSD_INTPMR__DSPCLKFREQ">
        <value caption="DSP Clock (DSPCLK) is 12.288 MHz." name="_12M288" value="0"/>
        <value caption="DSP Clock (DSPCLK) is 11.2896 MHz." name="_11M2896" value="1"/>
      </value-group>
      <value-group caption="Enable De-emphasis Filter" name="CLASSD_INTPMR__DEEMP">
        <value caption="De-emphasis filter is disabled." name="DISABLED" value="0"/>
        <value caption="De-emphasis filter is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Swap Left and Right Channels" name="CLASSD_INTPMR__SWAP">
        <value caption="Left channel is on CLASSD_THR[15:0], right channel is on CLASSD_THR[31:16]." name="LEFT_ON_LSB" value="0"/>
        <value caption="Right channel is on CLASSD_THR[15:0], left channel is on CLASSD_THR[31:16]." name="RIGHT_ON_LSB" value="1"/>
      </value-group>
      <value-group caption="CLASSD Incoming Data Sampling Frequency" name="CLASSD_INTPMR__FRAME">
        <value caption="8 kHz" name="FRAME_8K" value="0x0"/>
        <value caption="16 kHz" name="FRAME_16K" value="0x1"/>
        <value caption="32 kHz" name="FRAME_32K" value="0x2"/>
        <value caption="48 kHz" name="FRAME_48K" value="0x3"/>
        <value caption="96 kHz" name="FRAME_96K" value="0x4"/>
        <value caption="22.05 kHz" name="FRAME_22K" value="0x5"/>
        <value caption="44.1 kHz" name="FRAME_44K" value="0x6"/>
        <value caption="88.2 kHz" name="FRAME_88K" value="0x7"/>
      </value-group>
      <value-group caption="Equalization Selection" name="CLASSD_INTPMR__EQCFG">
        <value caption="Flat Response" name="FLAT" value="0x0"/>
        <value caption="Bass boost +12 dB" name="BBOOST12" value="0x1"/>
        <value caption="Bass boost +6 dB" name="BBOOST6" value="0x2"/>
        <value caption="Bass cut -12 dB" name="BCUT12" value="0x3"/>
        <value caption="Bass cut -6 dB" name="BCUT6" value="0x4"/>
        <value caption="Medium boost +3 dB" name="MBOOST3" value="0x5"/>
        <value caption="Medium boost +8 dB" name="MBOOST8" value="0x6"/>
        <value caption="Medium cut -3 dB" name="MCUT3" value="0x7"/>
        <value caption="Medium cut -8 dB" name="MCUT8" value="0x8"/>
        <value caption="Treble boost +12 dB" name="TBOOST12" value="0x9"/>
        <value caption="Treble boost +6 dB" name="TBOOST6" value="0xA"/>
        <value caption="Treble cut -12 dB" name="TCUT12" value="0xB"/>
        <value caption="Treble cut -6 dB" name="TCUT6" value="0xC"/>
      </value-group>
