Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D225CD1M.atdf
        <register caption="TWI Master Mode Register" name="FLEX_TWI_MMR" offset="0x604" rw="RW" size="4">
          <bitfield caption="Internal Device Address Size" mask="0x00000300" name="IADRSZ" values="FLEX_TWI_MMR__IADRSZ"/>
          <bitfield caption="Master Read Direction" mask="0x00001000" name="MREAD"/>
          <bitfield caption="Device Address" mask="0x007F0000" name="DADR"/>
        </register>
        <register caption="TWI Slave Mode Register" name="FLEX_TWI_SMR" offset="0x608" rw="RW" size="4">
          <bitfield caption="Slave Receiver Data Phase NACK Enable" mask="0x00000001" name="NACKEN"/>
          <bitfield caption="SMBus Default Address" mask="0x00000004" name="SMDA"/>
          <bitfield caption="SMBus Host Header" mask="0x00000008" name="SMHH"/>
          <bitfield caption="Clock Wait State Disable" mask="0x00000040" name="SCLWSDIS"/>
          <bitfield caption="Slave Address Mask" mask="0x00007F00" name="MASK"/>
          <bitfield caption="Slave Address" mask="0x007F0000" name="SADR"/>
          <bitfield caption="Slave Address 1 Enable" mask="0x10000000" name="SADR1EN"/>
          <bitfield caption="Slave Address 2 Enable" mask="0x20000000" name="SADR2EN"/>
          <bitfield caption="Slave Address 3 Enable" mask="0x40000000" name="SADR3EN"/>
          <bitfield caption="Data Matching Enable" mask="0x80000000" name="DATAMEN"/>
        </register>
        <register caption="TWI Internal Address Register" name="FLEX_TWI_IADR" offset="0x60C" rw="RW" size="4">
          <bitfield caption="Internal Address" mask="0x00FFFFFF" name="IADR"/>
        </register>
        <register caption="TWI Clock Waveform Generator Register" name="FLEX_TWI_CWGR" offset="0x610" rw="RW" size="4">
          <bitfield caption="Clock Low Divider" mask="0x000000FF" name="CLDIV"/>
          <bitfield caption="Clock High Divider" mask="0x0000FF00" name="CHDIV"/>
          <bitfield caption="Clock Divider" mask="0x00070000" name="CKDIV"/>
          <bitfield caption="Bit Rate Source Clock" mask="0x00100000" name="BRSRCCLK" values="FLEX_TWI_CWGR__BRSRCCLK"/>
          <bitfield caption="TWD Hold Time Versus TWCK Falling" mask="0x1F000000" name="HOLD"/>
        </register>
        <register caption="TWI Status Register" name="FLEX_TWI_SR" offset="0x620" rw="R" size="4">
          <mode name="DEFAULT" qualifier="FLEX_TWI_CR.FIFO_ENABLED" value="0"/>
          <mode name="FIFO_ENABLED" qualifier="FLEX_TWI_CR.FIFO_ENABLED" value="1"/>
          <bitfield caption="Transmission Completed (cleared by writing FLEX_TWI_THR)" mask="0x00000001" modes="DEFAULT" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready (cleared when reading FLEX_TWI_RHR)" mask="0x00000002" modes="DEFAULT" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready (cleared by writing FLEX_TWI_THR)" mask="0x00000004" modes="DEFAULT" name="TXRDY"/>
          <bitfield caption="Slave Read" mask="0x00000008" modes="DEFAULT" name="SVREAD"/>
          <bitfield caption="Slave Access" mask="0x00000010" modes="DEFAULT" name="SVACC"/>
          <bitfield caption="General Call Access (cleared on read)" mask="0x00000020" modes="DEFAULT" name="GACC"/>
          <bitfield caption="Overrun Error (cleared on read)" mask="0x00000040" modes="DEFAULT" name="OVRE"/>
          <bitfield caption="Underrun Error (cleared on read)" mask="0x00000080" modes="DEFAULT" name="UNRE"/>
          <bitfield caption="Not Acknowledged (cleared on read)" mask="0x00000100" modes="DEFAULT" name="NACK"/>
          <bitfield caption="Arbitration Lost (cleared on read)" mask="0x00000200" modes="DEFAULT" name="ARBLST"/>
          <bitfield caption="Clock Wait State" mask="0x00000400" modes="DEFAULT" name="SCLWS"/>
          <bitfield caption="End Of Slave Access (cleared on read)" mask="0x00000800" modes="DEFAULT" name="EOSACC"/>
          <bitfield caption="Master Code Acknowledge (cleared on read)" mask="0x00010000" modes="DEFAULT" name="MCACK"/>
          <bitfield caption="Timeout Error (cleared on read)" mask="0x00040000" modes="DEFAULT" name="TOUT"/>
          <bitfield caption="PEC Error (cleared on read)" mask="0x00080000" modes="DEFAULT" name="PECERR"/>
          <bitfield caption="SMBus Default Address Match (cleared on read)" mask="0x00100000" modes="DEFAULT" name="SMBDAM"/>
          <bitfield caption="SMBus Host Header Address Match (cleared on read)" mask="0x00200000" modes="DEFAULT" name="SMBHHM"/>
          <bitfield caption="TWI Lock Due to Frame Errors" mask="0x00800000" modes="DEFAULT" name="LOCK"/>
          <bitfield caption="SCL Line Value" mask="0x01000000" modes="DEFAULT" name="SCL"/>
          <bitfield caption="SDA Line Value" mask="0x02000000" modes="DEFAULT" name="SDA"/>
          <bitfield caption="Transmission Completed (cleared by writing FLEX_TWI_THR)" mask="0x00000001" modes="FIFO_ENABLED" name="TXCOMP"/>
          <bitfield caption="Receive Holding Register Ready (cleared when reading FLEX_TWI_RHR)" mask="0x00000002" modes="FIFO_ENABLED" name="RXRDY"/>
          <bitfield caption="Transmit Holding Register Ready (cleared by writing FLEX_TWI_THR)" mask="0x00000004" modes="FIFO_ENABLED" name="TXRDY"/>
          <bitfield caption="Slave Read" mask="0x00000008" modes="FIFO_ENABLED" name="SVREAD"/>
          <bitfield caption="Slave Access" mask="0x00000010" modes="FIFO_ENABLED" name="SVACC"/>
          <bitfield caption="General Call Access (cleared on read)" mask="0x00000020" modes="FIFO_ENABLED" name="GACC"/>
          <bitfield caption="Overrun Error (cleared on read)" mask="0x00000040" modes="FIFO_ENABLED" name="OVRE"/>
          <bitfield caption="Underrun Error (cleared on read)" mask="0x00000080" modes="FIFO_ENABLED" name="UNRE"/>
          <bitfield caption="Not Acknowledged (cleared on read)" mask="0x00000100" modes="FIFO_ENABLED" name="NACK"/>
          <bitfield caption="Arbitration Lost (cleared on read)" mask="0x00000200" modes="FIFO_ENABLED" name="ARBLST"/>
          <bitfield caption="Clock Wait State" mask="0x00000400" modes="FIFO_ENABLED" name="SCLWS"/>
          <bitfield caption="End Of Slave Access (cleared on read)" mask="0x00000800" modes="FIFO_ENABLED" name="EOSACC"/>
          <bitfield caption="Master Code Acknowledge (cleared on read)" mask="0x00010000" modes="FIFO_ENABLED" name="MCACK"/>
          <bitfield caption="Timeout Error (cleared on read)" mask="0x00040000" modes="FIFO_ENABLED" name="TOUT"/>
          <bitfield caption="PEC Error (cleared on read)" mask="0x00080000" modes="FIFO_ENABLED" name="PECERR"/>
          <bitfield caption="SMBus Default Address Match (cleared on read)" mask="0x00100000" modes="FIFO_ENABLED" name="SMBDAM"/>
          <bitfield caption="SMBus Host Header Address Match (cleared on read)" mask="0x00200000" modes="FIFO_ENABLED" name="SMBHHM"/>
          <bitfield caption="Transmit FIFO Lock" mask="0x00800000" modes="FIFO_ENABLED" name="TXFLOCK"/>
          <bitfield caption="SCL Line Value" mask="0x01000000" modes="FIFO_ENABLED" name="SCL"/>
          <bitfield caption="SDA Line Value" mask="0x02000000" modes="FIFO_ENABLED" name="SDA"/>
        </register>
