Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D225CD1M.atdf
      <value-group caption="Control of Transmit Pin (read/write)" name="MCAN_TEST__TX">
        <value caption="Reset value, CANTX controlled by the CAN Core, updated at the end of the CAN bit time." name="RESET" value="0x0"/>
        <value caption="Sample Point can be monitored at pin CANTX." name="SAMPLE_POINT_MONITORING" value="0x1"/>
        <value caption="Dominant ('0') level at pin CANTX." name="DOMINANT" value="0x2"/>
        <value caption="Recessive ('1') at pin CANTX." name="RECESSIVE" value="0x3"/>
      </value-group>
      <value-group caption="Initialization (read/write)" name="MCAN_CCCR__INIT">
        <value caption="Normal operation." name="DISABLED" value="0"/>
        <value caption="Initialization is started." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Configuration Change Enable (read/write, write protection)" name="MCAN_CCCR__CCE">
        <value caption="The processor has no write access to the protected configuration registers." name="PROTECTED" value="0"/>
        <value caption="The processor has write access to the protected configuration registers (while MCAN_CCCR.INIT = '1')." name="CONFIGURABLE" value="1"/>
      </value-group>
      <value-group caption="Restricted Operation Mode (read/write, write protection against '1')" name="MCAN_CCCR__ASM">
        <value caption="Normal CAN operation." name="NORMAL" value="0"/>
        <value caption="Restricted Operation mode active." name="RESTRICTED" value="1"/>
      </value-group>
      <value-group caption="Clock Stop Request (read/write)" name="MCAN_CCCR__CSR">
        <value caption="No clock stop is requested." name="NO_CLOCK_STOP" value="0"/>
        <value caption="Clock stop requested. When clock stop is requested, first INIT and then CSA will be set after all pend-ing transfer requests have been completed and the CAN bus reached idle." name="CLOCK_STOP" value="1"/>
      </value-group>
      <value-group caption="Bus Monitoring Mode (read/write, write protection against '1')" name="MCAN_CCCR__MON">
        <value caption="Bus Monitoring mode is disabled." name="DISABLED" value="0"/>
        <value caption="Bus Monitoring mode is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Disable Automatic Retransmission (read/write, write protection)" name="MCAN_CCCR__DAR">
        <value caption="Automatic retransmission of messages not transmitted successfully enabled." name="AUTO_RETX" value="0"/>
        <value caption="Automatic retransmission disabled." name="NO_AUTO_RETX" value="1"/>
      </value-group>
      <value-group caption="Test Mode Enable (read/write, write protection against '1')" name="MCAN_CCCR__TEST">
        <value caption="Normal operation, MCAN_TEST register holds reset values." name="DISABLED" value="0"/>
        <value caption="Test mode, write access to MCAN_TEST register enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="CAN FD Operation Enable (read/write, write protection)" name="MCAN_CCCR__FDOE">
        <value caption="FD operation disabled." name="DISABLED" value="0"/>
        <value caption="FD operation enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Bit Rate Switching Enable (read/write, write protection)" name="MCAN_CCCR__BRSE">
        <value caption="Bit rate switching for transmissions disabled." name="DISABLED" value="0"/>
        <value caption="Bit rate switching for transmissions enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Timestamp Select" name="MCAN_TSCC__TSS">
        <value caption="Timestamp counter value always 0x0000" name="ALWAYS_0" value="0x0"/>
        <value caption="Timestamp counter value incremented according to TCP" name="TCP_INC" value="0x1"/>
        <value caption="External timestamp counter value used" name="EXT_TIMESTAMP" value="0x2"/>
      </value-group>
      <value-group caption="Enable Timeout Counter" name="MCAN_TOCC__ETOC">
        <value caption="Timeout Counter disabled." name="NO_TIMEOUT" value="0"/>
        <value caption="Timeout Counter enabled." name="TOS_CONTROLLED" value="1"/>
      </value-group>
      <value-group caption="Timeout Select" name="MCAN_TOCC__TOS">
        <value caption="Continuous operation" name="CONTINUOUS" value="0x0"/>
        <value caption="Timeout controlled by Tx Event FIFO" name="TX_EV_TIMEOUT" value="0x1"/>
        <value caption="Timeout controlled by Receive FIFO 0" name="RX0_EV_TIMEOUT" value="0x2"/>
        <value caption="Timeout controlled by Receive FIFO 1" name="RX1_EV_TIMEOUT" value="0x3"/>
      </value-group>
      <value-group caption="Last Error Code (set to 111 on read)" name="MCAN_PSR__LEC">
        <value caption="No error occurred since LEC has been reset by successful reception or transmission." name="NO_ERROR" value="0x0"/>
        <value caption="More than 5 equal bits in a sequence have occurred in a part of a received message where this is not allowed." name="STUFF_ERROR" value="0x1"/>
        <value caption="A fixed format part of a received frame has the wrong format." name="FORM_ERROR" value="0x2"/>
        <value caption="The message transmitted by the MCAN was not acknowledged by another node." name="ACK_ERROR" value="0x3"/>
        <value caption="During transmission of a message (with the exception of the arbitration field), the device tried to send a recessive level (bit of logical value '1'), but the monitored bus value was dominant." name="BIT1_ERROR" value="0x4"/>
        <value caption="During transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device tried to send a dominant level (data or identifier bit logical value '0'), but the monitored bus value was recessive. During Bus_Off recovery, this status is set each time a sequence of 11 recessive bits has been monitored. This enables the processor to monitor the proceeding of the Bus_Off recovery sequence (indicating the bus is not stuck at dominant or continuously disturbed)." name="BIT0_ERROR" value="0x5"/>
        <value caption="The CRC check sum of a received message was incorrect. The CRC of an incoming message does not match the CRC calculated from the received data." name="CRC_ERROR" value="0x6"/>
        <value caption="Any read access to the Protocol Status Register re-initializes the LEC to '7'. When the LEC shows value '7', no CAN bus event was detected since the last processor read access to the Protocol Status Register." name="NO_CHANGE" value="0x7"/>
      </value-group>
