Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D225CD1M.atdf
      <register-group name="PIO_SGROUP" size="64">
        <register caption="Secure PIO Mask Register" name="S_PIO_MSKR" offset="0x0" rw="RW" size="4">
          <bitfield caption="PIO Line 0 Mask" mask="0x00000001" name="MSK0" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 1 Mask" mask="0x00000002" name="MSK1" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 2 Mask" mask="0x00000004" name="MSK2" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 3 Mask" mask="0x00000008" name="MSK3" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 4 Mask" mask="0x00000010" name="MSK4" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 5 Mask" mask="0x00000020" name="MSK5" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 6 Mask" mask="0x00000040" name="MSK6" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 7 Mask" mask="0x00000080" name="MSK7" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 8 Mask" mask="0x00000100" name="MSK8" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 9 Mask" mask="0x00000200" name="MSK9" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 10 Mask" mask="0x00000400" name="MSK10" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 11 Mask" mask="0x00000800" name="MSK11" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 12 Mask" mask="0x00001000" name="MSK12" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 13 Mask" mask="0x00002000" name="MSK13" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 14 Mask" mask="0x00004000" name="MSK14" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 15 Mask" mask="0x00008000" name="MSK15" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 16 Mask" mask="0x00010000" name="MSK16" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 17 Mask" mask="0x00020000" name="MSK17" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 18 Mask" mask="0x00040000" name="MSK18" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 19 Mask" mask="0x00080000" name="MSK19" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 20 Mask" mask="0x00100000" name="MSK20" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 21 Mask" mask="0x00200000" name="MSK21" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 22 Mask" mask="0x00400000" name="MSK22" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 23 Mask" mask="0x00800000" name="MSK23" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 24 Mask" mask="0x01000000" name="MSK24" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 25 Mask" mask="0x02000000" name="MSK25" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 26 Mask" mask="0x04000000" name="MSK26" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 27 Mask" mask="0x08000000" name="MSK27" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 28 Mask" mask="0x10000000" name="MSK28" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 29 Mask" mask="0x20000000" name="MSK29" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 30 Mask" mask="0x40000000" name="MSK30" values="S_PIO_MSKR0__MSKX"/>
          <bitfield caption="PIO Line 31 Mask" mask="0x80000000" name="MSK31" values="S_PIO_MSKR0__MSKX"/>
        </register>
        <register caption="Secure PIO Configuration Register" name="S_PIO_CFGR" offset="0x4" rw="RW" size="4">
          <bitfield caption="I/O Line Function" mask="0x00000007" name="FUNC" values="S_PIO_CFGR0__FUNC"/>
          <bitfield caption="Direction" mask="0x00000100" name="DIR" values="S_PIO_CFGR0__DIR"/>
          <bitfield caption="Pull-Up Enable" mask="0x00000200" name="PUEN" values="S_PIO_CFGR0__PUEN"/>
          <bitfield caption="Pull-Down Enable" mask="0x00000400" name="PDEN" values="S_PIO_CFGR0__PDEN"/>
          <bitfield caption="Input Filter Enable" mask="0x00001000" name="IFEN" values="S_PIO_CFGR0__IFEN"/>
          <bitfield caption="Input Filter Slow Clock Enable" mask="0x00002000" name="IFSCEN"/>
          <bitfield caption="Open-Drain" mask="0x00004000" name="OPD" values="S_PIO_CFGR0__OPD"/>
          <bitfield caption="Schmitt Trigger" mask="0x00008000" name="SCHMITT" values="S_PIO_CFGR0__SCHMITT"/>
          <bitfield caption="Drive Strength" mask="0x00030000" name="DRVSTR" values="S_PIO_CFGR0__DRVSTR"/>
          <bitfield caption="Event Selection" mask="0x07000000" name="EVTSEL" values="S_PIO_CFGR0__EVTSEL"/>
          <bitfield caption="Physical Configuration Freeze Status (read-only)" mask="0x20000000" name="PCFS" values="S_PIO_CFGR0__PCFS"/>
          <bitfield caption="Interrupt Configuration Freeze Status (read-only)" mask="0x40000000" name="ICFS" values="S_PIO_CFGR0__ICFS"/>
        </register>
        <register caption="Secure PIO Pin Data Status Register" name="S_PIO_PDSR" offset="0x8" rw="R" size="4">
          <bitfield caption="Input Data Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Input Data Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Input Data Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Input Data Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Input Data Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Input Data Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Input Data Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Input Data Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Input Data Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Input Data Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Input Data Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Input Data Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Input Data Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Input Data Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Input Data Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Input Data Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Input Data Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Input Data Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Input Data Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Input Data Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Input Data Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Input Data Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Input Data Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Input Data Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Input Data Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Input Data Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Input Data Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Input Data Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Input Data Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Input Data Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Input Data Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Input Data Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Secure PIO Lock Status Register" name="S_PIO_LOCKSR" offset="0xC" rw="R" size="4">
          <bitfield caption="Lock Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Lock Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Lock Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Lock Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Lock Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Lock Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Lock Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Lock Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Lock Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Lock Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Lock Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Lock Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Lock Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Lock Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Lock Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Lock Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Lock Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Lock Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Lock Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Lock Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Lock Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Lock Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Lock Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Lock Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Lock Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Lock Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Lock Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Lock Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Lock Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Lock Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Lock Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Lock Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Secure PIO Set Output Data Register" name="S_PIO_SODR" offset="0x10" rw="W" size="4">
          <bitfield caption="Set Output Data" mask="0x00000001" name="P0"/>
          <bitfield caption="Set Output Data" mask="0x00000002" name="P1"/>
          <bitfield caption="Set Output Data" mask="0x00000004" name="P2"/>
          <bitfield caption="Set Output Data" mask="0x00000008" name="P3"/>
          <bitfield caption="Set Output Data" mask="0x00000010" name="P4"/>
          <bitfield caption="Set Output Data" mask="0x00000020" name="P5"/>
          <bitfield caption="Set Output Data" mask="0x00000040" name="P6"/>
          <bitfield caption="Set Output Data" mask="0x00000080" name="P7"/>
          <bitfield caption="Set Output Data" mask="0x00000100" name="P8"/>
          <bitfield caption="Set Output Data" mask="0x00000200" name="P9"/>
          <bitfield caption="Set Output Data" mask="0x00000400" name="P10"/>
          <bitfield caption="Set Output Data" mask="0x00000800" name="P11"/>
          <bitfield caption="Set Output Data" mask="0x00001000" name="P12"/>
          <bitfield caption="Set Output Data" mask="0x00002000" name="P13"/>
          <bitfield caption="Set Output Data" mask="0x00004000" name="P14"/>
          <bitfield caption="Set Output Data" mask="0x00008000" name="P15"/>
          <bitfield caption="Set Output Data" mask="0x00010000" name="P16"/>
          <bitfield caption="Set Output Data" mask="0x00020000" name="P17"/>
          <bitfield caption="Set Output Data" mask="0x00040000" name="P18"/>
          <bitfield caption="Set Output Data" mask="0x00080000" name="P19"/>
          <bitfield caption="Set Output Data" mask="0x00100000" name="P20"/>
          <bitfield caption="Set Output Data" mask="0x00200000" name="P21"/>
          <bitfield caption="Set Output Data" mask="0x00400000" name="P22"/>
          <bitfield caption="Set Output Data" mask="0x00800000" name="P23"/>
          <bitfield caption="Set Output Data" mask="0x01000000" name="P24"/>
          <bitfield caption="Set Output Data" mask="0x02000000" name="P25"/>
          <bitfield caption="Set Output Data" mask="0x04000000" name="P26"/>
          <bitfield caption="Set Output Data" mask="0x08000000" name="P27"/>
          <bitfield caption="Set Output Data" mask="0x10000000" name="P28"/>
          <bitfield caption="Set Output Data" mask="0x20000000" name="P29"/>
          <bitfield caption="Set Output Data" mask="0x40000000" name="P30"/>
          <bitfield caption="Set Output Data" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Secure PIO Clear Output Data Register" name="S_PIO_CODR" offset="0x14" rw="W" size="4">
          <bitfield caption="Clear Output Data" mask="0x00000001" name="P0"/>
          <bitfield caption="Clear Output Data" mask="0x00000002" name="P1"/>
          <bitfield caption="Clear Output Data" mask="0x00000004" name="P2"/>
          <bitfield caption="Clear Output Data" mask="0x00000008" name="P3"/>
          <bitfield caption="Clear Output Data" mask="0x00000010" name="P4"/>
          <bitfield caption="Clear Output Data" mask="0x00000020" name="P5"/>
          <bitfield caption="Clear Output Data" mask="0x00000040" name="P6"/>
          <bitfield caption="Clear Output Data" mask="0x00000080" name="P7"/>
          <bitfield caption="Clear Output Data" mask="0x00000100" name="P8"/>
          <bitfield caption="Clear Output Data" mask="0x00000200" name="P9"/>
          <bitfield caption="Clear Output Data" mask="0x00000400" name="P10"/>
          <bitfield caption="Clear Output Data" mask="0x00000800" name="P11"/>
          <bitfield caption="Clear Output Data" mask="0x00001000" name="P12"/>
          <bitfield caption="Clear Output Data" mask="0x00002000" name="P13"/>
          <bitfield caption="Clear Output Data" mask="0x00004000" name="P14"/>
          <bitfield caption="Clear Output Data" mask="0x00008000" name="P15"/>
          <bitfield caption="Clear Output Data" mask="0x00010000" name="P16"/>
          <bitfield caption="Clear Output Data" mask="0x00020000" name="P17"/>
          <bitfield caption="Clear Output Data" mask="0x00040000" name="P18"/>
          <bitfield caption="Clear Output Data" mask="0x00080000" name="P19"/>
          <bitfield caption="Clear Output Data" mask="0x00100000" name="P20"/>
          <bitfield caption="Clear Output Data" mask="0x00200000" name="P21"/>
          <bitfield caption="Clear Output Data" mask="0x00400000" name="P22"/>
          <bitfield caption="Clear Output Data" mask="0x00800000" name="P23"/>
          <bitfield caption="Clear Output Data" mask="0x01000000" name="P24"/>
          <bitfield caption="Clear Output Data" mask="0x02000000" name="P25"/>
          <bitfield caption="Clear Output Data" mask="0x04000000" name="P26"/>
          <bitfield caption="Clear Output Data" mask="0x08000000" name="P27"/>
          <bitfield caption="Clear Output Data" mask="0x10000000" name="P28"/>
          <bitfield caption="Clear Output Data" mask="0x20000000" name="P29"/>
          <bitfield caption="Clear Output Data" mask="0x40000000" name="P30"/>
          <bitfield caption="Clear Output Data" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Secure PIO Output Data Status Register" name="S_PIO_ODSR" offset="0x18" rw="RW" size="4">
          <bitfield caption="Output Data Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Data Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Data Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Data Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Data Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Data Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Data Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Data Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Data Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Data Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Data Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Data Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Data Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Data Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Data Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Data Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Data Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Data Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Data Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Data Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Data Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Data Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Data Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Data Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Data Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Data Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Data Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Data Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Data Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Data Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Data Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Data Status" mask="0x80000000" name="P31"/>
        </register>
