Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D225CD1M.atdf
        <register caption="TimeStamp Date Register 0" name="RTC_TSDR" offset="0x4" rw="R" size="4">
          <mode name="DEFAULT" qualifier="RTC_MR.UTC" value="0"/>
          <mode name="UTC_MODE" qualifier="RTC_MR.UTC" value="0"/>
          <bitfield caption="Century of the Tamper" mask="0x0000007F" modes="DEFAULT" name="CENT"/>
          <bitfield caption="Year of the Tamper" mask="0x0000FF00" modes="DEFAULT" name="YEAR"/>
          <bitfield caption="Month of the Tamper" mask="0x001F0000" modes="DEFAULT" name="MONTH"/>
          <bitfield caption="Day of the Tamper" mask="0x00E00000" modes="DEFAULT" name="DAY"/>
          <bitfield caption="Date of the Tamper" mask="0x3F000000" modes="DEFAULT" name="DATE"/>
          <bitfield caption="Time of the Tamper (UTC format)" mask="0xFFFFFFFF" modes="UTC_MODE" name="UTC_TIME"/>
        </register>
        <register caption="TimeStamp Source Register 0" name="RTC_TSSR" offset="0x8" rw="R" size="4">
          <bitfield caption="Test Pin Monitor" mask="0x00000004" name="TST"/>
          <bitfield caption="JTAG Pins Monitor" mask="0x00000008" name="JTAG"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00010000" name="DET0"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00020000" name="DET1"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00040000" name="DET2"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00080000" name="DET3"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00100000" name="DET4"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00200000" name="DET5"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00400000" name="DET6"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00800000" name="DET7"/>
        </register>
      </register-group>
      <register-group name="RTC">
        <register caption="Control Register" name="RTC_CR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Update Request Time Register" mask="0x00000001" name="UPDTIM"/>
          <bitfield caption="Update Request Calendar Register" mask="0x00000002" name="UPDCAL"/>
          <bitfield caption="Time Event Selection" mask="0x00000300" name="TIMEVSEL" values="RTC_CR__TIMEVSEL"/>
          <bitfield caption="Calendar Event Selection" mask="0x00030000" name="CALEVSEL" values="RTC_CR__CALEVSEL"/>
        </register>
        <register caption="Mode Register" name="RTC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="12-/24-hour Mode" mask="0x00000001" name="HRMOD"/>
          <bitfield caption="PERSIAN Calendar" mask="0x00000002" name="PERSIAN"/>
          <bitfield caption="UTC Time Format" mask="0x00000004" name="UTC"/>
          <bitfield caption="NEGative PPM Correction" mask="0x00000010" name="NEGPPM"/>
          <bitfield caption="Slow Clock Correction" mask="0x00007F00" name="CORRECTION"/>
          <bitfield caption="HIGH PPM Correction" mask="0x00008000" name="HIGHPPM"/>
          <bitfield caption="All ADC Channel Trigger Event Source Selection" mask="0x00070000" name="OUT0" values="RTC_MR__OUT0"/>
          <bitfield caption="ADC Last Channel Trigger Event Source Selection" mask="0x00700000" name="OUT1" values="RTC_MR__OUT1"/>
          <bitfield caption="High Duration of the Output Pulse" mask="0x07000000" name="THIGH" values="RTC_MR__THIGH"/>
          <bitfield caption="Period of the Output Pulse" mask="0x30000000" name="TPERIOD" values="RTC_MR__TPERIOD"/>
        </register>
        <register caption="Time Register" name="RTC_TIMR" offset="0x08" rw="RW" size="4">
          <mode name="DEFAULT" qualifier="RTC_MR.UTC" value="0"/>
          <mode name="UTC_MODE" qualifier="RTC_MR.UTC" value="0"/>
          <bitfield caption="Current Second" mask="0x0000007F" modes="DEFAULT" name="SEC"/>
          <bitfield caption="Current Minute" mask="0x00007F00" modes="DEFAULT" name="MIN"/>
          <bitfield caption="Current Hour" mask="0x003F0000" modes="DEFAULT" name="HOUR"/>
          <bitfield caption="Ante Meridiem Post Meridiem Indicator" mask="0x00400000" modes="DEFAULT" name="AMPM"/>
          <bitfield caption="Current UTC Time" mask="0xFFFFFFFF" modes="UTC_MODE" name="UTC_TIME"/>
        </register>
        <register caption="Calendar Register" name="RTC_CALR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Current Century" mask="0x0000007F" name="CENT"/>
          <bitfield caption="Current Year" mask="0x0000FF00" name="YEAR"/>
          <bitfield caption="Current Month" mask="0x001F0000" name="MONTH"/>
          <bitfield caption="Current Day in Current Week" mask="0x00E00000" name="DAY"/>
          <bitfield caption="Current Day in Current Month" mask="0x3F000000" name="DATE"/>
        </register>
        <register caption="Time Alarm Register" name="RTC_TIMALR" offset="0x10" rw="RW" size="4">
          <mode name="DEFAULT" qualifier="RTC_MR.UTC" value="0"/>
          <mode name="UTC_MODE" qualifier="RTC_MR.UTC" value="0"/>
          <bitfield caption="Second Alarm" mask="0x0000007F" modes="DEFAULT" name="SEC"/>
          <bitfield caption="Second Alarm Enable" mask="0x00000080" modes="DEFAULT" name="SECEN"/>
          <bitfield caption="Minute Alarm" mask="0x00007F00" modes="DEFAULT" name="MIN"/>
          <bitfield caption="Minute Alarm Enable" mask="0x00008000" modes="DEFAULT" name="MINEN"/>
          <bitfield caption="Hour Alarm" mask="0x003F0000" modes="DEFAULT" name="HOUR"/>
          <bitfield caption="AM/PM Indicator" mask="0x00400000" modes="DEFAULT" name="AMPM"/>
          <bitfield caption="Hour Alarm Enable" mask="0x00800000" modes="DEFAULT" name="HOUREN"/>
          <bitfield caption="UTC_TIME Alarm" mask="0xFFFFFFFF" modes="UTC_MODE" name="UTC_TIME"/>
        </register>
        <register caption="Calendar Alarm Register" name="RTC_CALALR" offset="0x14" rw="RW" size="4">
          <mode name="DEFAULT" qualifier="RTC_MR.UTC" value="0"/>
          <mode name="UTC_MODE" qualifier="RTC_MR.UTC" value="0"/>
          <bitfield caption="Month Alarm" mask="0x001F0000" modes="DEFAULT" name="MONTH"/>
          <bitfield caption="Month Alarm Enable" mask="0x00800000" modes="DEFAULT" name="MTHEN"/>
          <bitfield caption="Date Alarm" mask="0x3F000000" modes="DEFAULT" name="DATE"/>
          <bitfield caption="Date Alarm Enable" mask="0x80000000" modes="DEFAULT" name="DATEEN"/>
          <bitfield caption="UTC Alarm Enable" mask="0x00000001" modes="UTC_MODE" name="UTCEN"/>
        </register>
        <register caption="Status Register" name="RTC_SR" offset="0x18" rw="R" size="4">
          <bitfield caption="Acknowledge for Update" mask="0x00000001" name="ACKUPD" values="RTC_SR__ACKUPD"/>
          <bitfield caption="Alarm Flag" mask="0x00000002" name="ALARM" values="RTC_SR__ALARM"/>
          <bitfield caption="Second Event" mask="0x00000004" name="SEC" values="RTC_SR__SEC"/>
          <bitfield caption="Time Event" mask="0x00000008" name="TIMEV" values="RTC_SR__TIMEV"/>
          <bitfield caption="Calendar Event" mask="0x00000010" name="CALEV" values="RTC_SR__CALEV"/>
          <bitfield caption="Time and/or Date Free Running Error" mask="0x00000020" name="TDERR" values="RTC_SR__TDERR"/>
        </register>
        <register caption="Status Clear Command Register" name="RTC_SCCR" offset="0x1C" rw="W" size="4">
          <bitfield caption="Acknowledge Clear" mask="0x00000001" name="ACKCLR"/>
          <bitfield caption="Alarm Clear" mask="0x00000002" name="ALRCLR"/>
          <bitfield caption="Second Clear" mask="0x00000004" name="SECCLR"/>
          <bitfield caption="Time Clear" mask="0x00000008" name="TIMCLR"/>
          <bitfield caption="Calendar Clear" mask="0x00000010" name="CALCLR"/>
          <bitfield caption="Time and/or Date Free Running Error Clear" mask="0x00000020" name="TDERRCLR"/>
        </register>
