Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D225CD1M.atdf
        <register caption="Comparison Register" name="RXLP_CMPR" offset="0x0024" rw="RW" size="4">
          <bitfield caption="First Comparison Value for Received Character" mask="0x000000FF" name="VAL1"/>
          <bitfield caption="Second Comparison Value for Received Character" mask="0x00FF0000" name="VAL2"/>
        </register>
        <register caption="Write Protection Mode Register" name="RXLP_WPMR" offset="0x00E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="RXLP_WPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="Receiver Digital Filter" name="RXLP_MR__FILTER">
        <value caption="RXLP does not filter the receive line." name="DISABLED" value="0"/>
        <value caption="RXLP filters the receive line using a three-sample filter (16x-bit clock) (2 over 3 majority)." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Parity Type" name="RXLP_MR__PAR">
        <value caption="Even Parity" name="EVEN" value="0x0"/>
        <value caption="Odd Parity" name="ODD" value="0x1"/>
        <value caption="Parity forced to 0" name="SPACE" value="0x2"/>
        <value caption="Parity forced to 1" name="MARK" value="0x3"/>
        <value caption="No parity" name="NO" value="0x4"/>
      </value-group>
      <value-group caption="Write Protection Key" name="RXLP_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0x52584C"/>
      </value-group>
    </module>
    <module caption="Slow Clock Controller" id="11073" name="SCKC" version="G">
      <register-group name="SCKC">
        <register caption="Slow Clock Controller Configuration Register" name="SCKC_CR" offset="0x0" rw="RW" size="4">
          <bitfield caption="Slow Clock Selector" mask="0x00000008" name="OSCSEL" values="SCKC_CR__OSCSEL"/>
        </register>
      </register-group>
      <value-group caption="Slow Clock Selector" name="SCKC_CR__OSCSEL">
        <value caption="Slow clock is the embedded 64 kHz (typical) RC oscillator." name="RC" value="0"/>
        <value caption="Slow clock is the 32.768 kHz crystal oscillator." name="XTAL" value="1"/>
      </value-group>
    </module>
    <module caption="Secure Digital MultiMedia Card Controller" id="44002" name="SDMMC" version="H">
      <register-group name="SDMMC">
        <register caption="SDMA System Address / Argument 2 Register" name="SDMMC_SSAR" offset="0x00" rw="RW" size="4">
          <bitfield caption="SDMA System Address" mask="0xFFFFFFFF" name="ADDR"/>
          <bitfield caption="Argument 2" mask="0xFFFFFFFF" name="ARG2"/>
        </register>
        <register caption="Block Size Register" name="SDMMC_BSR" offset="0x04" rw="RW" size="2">
          <bitfield caption="Transfer Block Size" mask="0x000003FF" name="BLKSIZE"/>
          <bitfield caption="SDMA Buffer Boundary" mask="0x00007000" name="BOUNDARY" values="SDMMC_BSR__BOUNDARY"/>
        </register>
        <register caption="Block Count Register" name="SDMMC_BCR" offset="0x06" rw="RW" size="2">
          <bitfield caption="Block Count for Current Transfer" mask="0x0000FFFF" name="BLKCNT"/>
        </register>
        <register caption="Argument 1 Register" name="SDMMC_ARG1R" offset="0x08" rw="RW" size="4">
          <bitfield caption="Argument 1" mask="0xFFFFFFFF" name="ARG1"/>
        </register>
        <register caption="Transfer Mode Register" name="SDMMC_TMR" offset="0x0C" rw="RW" size="2">
          <bitfield caption="DMA Enable" mask="0x00000001" name="DMAEN" values="SDMMC_TMR__DMAEN"/>
          <bitfield caption="Block Count Enable" mask="0x00000002" name="BCEN" values="SDMMC_TMR__BCEN"/>
          <bitfield caption="Auto Command Enable" mask="0x0000000C" name="ACMDEN" values="SDMMC_TMR__ACMDEN"/>
          <bitfield caption="Data Transfer Direction Selection" mask="0x00000010" name="DTDSEL" values="SDMMC_TMR__DTDSEL"/>
          <bitfield caption="Multi/Single Block Selection" mask="0x00000020" name="MSBSEL"/>
        </register>
        <register caption="Command Register" name="SDMMC_CR" offset="0x0E" rw="RW" size="2">
          <bitfield caption="Response Type" mask="0x00000003" name="RESPTYP" values="SDMMC_CR__RESPTYP"/>
          <bitfield caption="Command CRC Check Enable" mask="0x00000008" name="CMDCCEN" values="SDMMC_CR__CMDCCEN"/>
          <bitfield caption="Command Index Check Enable" mask="0x00000010" name="CMDICEN" values="SDMMC_CR__CMDICEN"/>
          <bitfield caption="Data Present Select" mask="0x00000020" name="DPSEL"/>
          <bitfield caption="Command Type" mask="0x000000C0" name="CMDTYP" values="SDMMC_CR__CMDTYP"/>
          <bitfield caption="Command Index" mask="0x00003F00" name="CMDIDX"/>
        </register>
        <register caption="Response Register" count="4" name="SDMMC_RR" offset="0x10" rw="R" size="4">
          <bitfield caption="Command Response" mask="0xFFFFFFFF" name="CMDRESP"/>
        </register>
        <register caption="Buffer Data Port Register" name="SDMMC_BDPR" offset="0x20" rw="RW" size="4">
          <bitfield caption="Buffer Data" mask="0xFFFFFFFF" name="BUFDATA"/>
        </register>
        <register caption="Present State Register" name="SDMMC_PSR" offset="0x24" rw="R" size="4">
          <bitfield caption="Command Inhibit (CMD)" mask="0x00000001" name="CMDINHC"/>
          <bitfield caption="Command Inhibit (DAT)" mask="0x00000002" name="CMDINHD"/>
          <bitfield caption="DAT Line Active" mask="0x00000004" name="DLACT"/>
          <bitfield caption="Write Transfer Active" mask="0x00000100" name="WTACT"/>
          <bitfield caption="Read Transfer Active" mask="0x00000200" name="RTACT"/>
          <bitfield caption="Buffer Write Enable" mask="0x00000400" name="BUFWREN"/>
          <bitfield caption="Buffer Read Enable" mask="0x00000800" name="BUFRDEN"/>
          <bitfield caption="Card Inserted" mask="0x00010000" name="CARDINS"/>
          <bitfield caption="Card State Stable" mask="0x00020000" name="CARDSS"/>
          <bitfield caption="Card Detect Pin Level" mask="0x00040000" name="CARDDPL"/>
          <bitfield caption="Write Protect Pin Level" mask="0x00080000" name="WRPPL"/>
          <bitfield caption="DAT[3:0] Line Level" mask="0x00F00000" name="DATLL"/>
          <bitfield caption="CMD Line Level" mask="0x01000000" name="CMDLL"/>
        </register>
        <register caption="Host Control 1 Register" name="SDMMC_HC1R" offset="0x28" rw="RW" size="1">
          <mode name="SD_SDIO"/>
          <mode name="E_MMC"/>
          <bitfield caption="LED Control" mask="0x00000001" modes="SD_SDIO" name="LEDCTRL" values="SDMMC_HC1R__LEDCTRL"/>
          <bitfield caption="Data Width" mask="0x00000002" modes="SD_SDIO" name="DW" values="SDMMC_HC1R__DW"/>
          <bitfield caption="High Speed Enable" mask="0x00000004" modes="SD_SDIO" name="HSEN"/>
          <bitfield caption="DMA Select" mask="0x00000018" modes="SD_SDIO" name="DMASEL" values="SDMMC_HC1R__DMASEL"/>
          <bitfield caption="Card Detect Test Level" mask="0x00000040" modes="SD_SDIO" name="CARDDTL"/>
          <bitfield caption="Card Detect Signal Selection" mask="0x00000080" modes="SD_SDIO" name="CARDDSEL"/>
          <bitfield caption="Data Width" mask="0x00000002" modes="E_MMC" name="DW" values="SDMMC_HC1R_E_MMC__DW"/>
          <bitfield caption="High Speed Enable" mask="0x00000004" modes="E_MMC" name="HSEN"/>
          <bitfield caption="DMA Select" mask="0x00000018" modes="E_MMC" name="DMASEL" values="SDMMC_HC1R_E_MMC__DMASEL"/>
          <bitfield caption="Extended Data Width" mask="0x00000020" modes="E_MMC" name="EXTDW"/>
        </register>
        <register caption="Power Control Register" name="SDMMC_PCR" offset="0x29" rw="RW" size="1">
          <bitfield caption="SD Bus Power" mask="0x00000001" name="SDBPWR"/>
        </register>
        <register caption="Block Gap Control Register" name="SDMMC_BGCR" offset="0x2A" rw="RW" size="1">
          <mode name="SD_SDIO"/>
          <mode name="E_MMC"/>
          <bitfield caption="Stop At Block Gap Request" mask="0x00000001" modes="SD_SDIO" name="STPBGR"/>
          <bitfield caption="Continue Request" mask="0x00000002" modes="SD_SDIO" name="CONTR"/>
          <bitfield caption="Read Wait Control" mask="0x00000004" modes="SD_SDIO" name="RWCTRL"/>
          <bitfield caption="Interrupt at Block Gap" mask="0x00000008" modes="SD_SDIO" name="INTBG" values="SDMMC_BGCR__INTBG"/>
          <bitfield caption="Stop At Block Gap Request" mask="0x00000001" modes="E_MMC" name="STPBGR"/>
          <bitfield caption="Continue Request" mask="0x00000002" modes="E_MMC" name="CONTR"/>
        </register>
