Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D225CD1M.atdf
        <register caption="System Status Register" name="SECUMOD_SYSR" offset="0x0004" rw="RW" size="4">
          <bitfield caption="Erasable Memories State (RW)" mask="0x00000001" name="ERASE_DONE"/>
          <bitfield caption="Erase Process Ongoing (RO)" mask="0x00000002" name="ERASE_ON"/>
          <bitfield caption="Backup Mode (RO)" mask="0x00000004" name="BACKUP"/>
          <bitfield caption="SWKUP State (RO)" mask="0x00000008" name="SWKUP"/>
          <bitfield caption="Automatic Backup Mode Enabled (RO)" mask="0x00000040" name="AUTOBKP"/>
          <bitfield caption="Scrambling Enabled (RO)" mask="0x00000080" name="SCRAMB"/>
        </register>
        <register caption="Status Register" name="SECUMOD_SR" offset="0x0008" rw="R" size="4">
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00010000" name="DET0"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00020000" name="DET1"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00040000" name="DET2"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00080000" name="DET3"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00100000" name="DET4"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00200000" name="DET5"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00400000" name="DET6"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00800000" name="DET7"/>
        </register>
        <register caption="Status Clear Register" name="SECUMOD_SCR" offset="0x0010" rw="W" size="4">
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00010000" name="DET0"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00020000" name="DET1"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00040000" name="DET2"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00080000" name="DET3"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00100000" name="DET4"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00200000" name="DET5"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00400000" name="DET6"/>
          <bitfield caption="PIOBU Intrusion Detector" mask="0x00800000" name="DET7"/>
        </register>
        <register caption="RAM Access Ready Register" name="SECUMOD_RAMRDY" offset="0x0014" rw="R" size="4">
          <bitfield caption="Ready for system access flag" mask="0x00000001" name="READY"/>
        </register>
        <register caption="PIO Backup Register" count="8" name="SECUMOD_PIOBU" offset="0x0018" rw="RW" size="4">
          <bitfield caption="PIOBU Alarm Filter Value" mask="0x0000000F" name="PIOBU_AFV"/>
          <bitfield caption="PIOBUx Reset Filter Value" mask="0x000000F0" name="PIOBU_RFV"/>
          <bitfield caption="Configure I/O Line in Input/Output" mask="0x00000100" name="OUTPUT"/>
          <bitfield caption="Set/Clear the I/O Line when configured in Output Mode (OUTPUT =1)" mask="0x00000200" name="PIO_SOD"/>
          <bitfield caption="Level on the Pin in Input Mode (OUTPUT = 0) (Read-only)" mask="0x00000400" name="PIO_PDS"/>
          <bitfield caption="Programmable Pull-up State" mask="0x00003000" name="PULLUP"/>
          <bitfield caption="Pull-up/Down Scheduled" mask="0x00004000" name="SCHEDULE"/>
          <bitfield caption="Switch State for Intrusion Detection" mask="0x00008000" name="SWITCH"/>
        </register>
        <register caption="JTAG Protection Control Register" name="SECUMOD_JTAGCR" offset="0x0068" rw="RW" size="4">
          <bitfield caption="Force NTRST" mask="0x00000001" name="FNTRST"/>
          <bitfield caption="Cortex-A5 Invasive/Non-Invasive Secure/Non-Secure Debug Permissions" mask="0x0000000E" name="CA5_DEBUG_MODE"/>
          <bitfield caption="Write ZERO" mask="0x00000010" name="WZO"/>
        </register>
        <register caption="Scrambling Key Register" name="SECUMOD_SCRKEY" offset="0x0070" rw="RW" size="4">
          <bitfield caption="Scrambling Key Value" mask="0xFFFFFFFF" name="SCRKEY"/>
        </register>
        <register caption="RAM Access Rights Register" name="SECUMOD_RAMACC" offset="0x0074" rw="RW" size="4">
          <bitfield caption="Access right for RAM region [0; 1 Kbyte]" mask="0x00000003" name="RW0"/>
          <bitfield caption="Access right for RAM region [1 Kbyte; 2 Kbytes]" mask="0x0000000C" name="RW1"/>
          <bitfield caption="Access right for RAM region [2 Kbytes; 3 Kbytes]" mask="0x00000030" name="RW2"/>
          <bitfield caption="Access right for RAM region [3 Kbytes; 4 Kbytes]" mask="0x000000C0" name="RW3"/>
          <bitfield caption="Access right for RAM region [4 Kbytes; 5 Kbytes]" mask="0x00000300" name="RW4"/>
          <bitfield caption="Access right for RAM region [5 Kbytes; 6 Kbytes] (register bank BUREG256b)" mask="0x00000C00" name="RW5"/>
        </register>
        <register caption="RAM Access Rights Status Register" name="SECUMOD_RAMACCSR" offset="0x0078" rw="RW" size="4">
          <bitfield caption="Access right status for RAM region [0; 1 Kbyte]" mask="0x00000003" name="RW0"/>
          <bitfield caption="Access right status for RAM region [1 Kbytes; 2 Kbytes]" mask="0x0000000C" name="RW1"/>
          <bitfield caption="Access right status for RAM region [2 Kbytes; 3 Kbytes]" mask="0x00000030" name="RW2"/>
          <bitfield caption="Access right status for RAM region [3 Kbytes; 4 Kbytes]" mask="0x000000C0" name="RW3"/>
          <bitfield caption="Access right status for RAM region [4 Kbytes; 5 Kbytes]" mask="0x00000300" name="RW4"/>
          <bitfield caption="Access right status for RAM region [5 Kbytes; 6 Kbytes] (register bank BUREG256b)" mask="0x00000C00" name="RW5"/>
        </register>
        <register caption="Backup Mode Protection Register" name="SECUMOD_BMPR" offset="0x007C" rw="RW" size="4">
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00010000" name="DET0"/>
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00020000" name="DET1"/>
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00040000" name="DET2"/>
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00080000" name="DET3"/>
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00100000" name="DET4"/>
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00200000" name="DET5"/>
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00400000" name="DET6"/>
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00800000" name="DET7"/>
        </register>
        <register caption="Normal Mode Protection Register" name="SECUMOD_NMPR" offset="0x0080" rw="RW" size="4">
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00010000" name="DET0"/>
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00020000" name="DET1"/>
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00040000" name="DET2"/>
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00080000" name="DET3"/>
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00100000" name="DET4"/>
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00200000" name="DET5"/>
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00400000" name="DET6"/>
          <bitfield caption="PIOBU Intrusion Detector Protection" mask="0x00800000" name="DET7"/>
        </register>
