Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.3.35/atdf/ATSAMA5D225CD1M.atdf
        <register caption="UHPHS Port Status and Control Register 1" name="UHPHS_PORTSC_1" offset="0x58" rw="RW" size="4">
          <bitfield caption="Current Connect Status (read-only)" mask="0x00000001" name="CCS"/>
          <bitfield caption="Connect Status Change (read/write clear)" mask="0x00000002" name="CSC"/>
          <bitfield caption="Port Enabled/Disabled (read/write)" mask="0x00000004" name="PED"/>
          <bitfield caption="Port Enable/Disable Change (read/write clear)" mask="0x00000008" name="PEDC"/>
          <bitfield caption="Over-current Active (read-only)" mask="0x00000010" name="OCA"/>
          <bitfield caption="Over-current Change (read/write clear)" mask="0x00000020" name="OCC"/>
          <bitfield caption="Force Port Resume (read/write)" mask="0x00000040" name="FPR"/>
          <bitfield caption="Suspend (read/write)" mask="0x00000080" name="SUS"/>
          <bitfield caption="Port Reset (read/write)" mask="0x00000100" name="PR"/>
          <bitfield caption="Line Status (read-only)" mask="0x00000C00" name="LS"/>
          <bitfield caption="Port Power (read/write or read-only)" mask="0x00001000" name="PP"/>
          <bitfield caption="Port Owner (read/write)" mask="0x00002000" name="PO"/>
          <bitfield caption="Port Indicator Control (read/write)" mask="0x0000C000" name="PIC"/>
          <bitfield caption="Port Test Control (read/write)" mask="0x000F0000" name="PTC"/>
          <bitfield caption="Wake on Connect Enable (read/write)" mask="0x00100000" name="WKCNNT_E"/>
          <bitfield caption="Wake on Disconnect Enable (read/write)" mask="0x00200000" name="WKDSCNNT_E"/>
          <bitfield caption="Wake on Over-current Enable (read/write)" mask="0x00400000" name="WKOC_E"/>
        </register>
        <register caption="UHPHS Port Status and Control Register 2" name="UHPHS_PORTSC_2" offset="0x5C" rw="RW" size="4">
          <bitfield caption="Current Connect Status (read-only)" mask="0x00000001" name="CCS"/>
          <bitfield caption="Connect Status Change (read/write clear)" mask="0x00000002" name="CSC"/>
          <bitfield caption="Port Enabled/Disabled (read/write)" mask="0x00000004" name="PED"/>
          <bitfield caption="Port Enable/Disable Change (read/write clear)" mask="0x00000008" name="PEDC"/>
          <bitfield caption="Over-current Active (read-only)" mask="0x00000010" name="OCA"/>
          <bitfield caption="Over-current Change (read/write clear)" mask="0x00000020" name="OCC"/>
          <bitfield caption="Force Port Resume (read/write)" mask="0x00000040" name="FPR"/>
          <bitfield caption="Suspend (read/write)" mask="0x00000080" name="SUS"/>
          <bitfield caption="Port Reset (read/write)" mask="0x00000100" name="PR"/>
          <bitfield caption="Line Status (read-only)" mask="0x00000C00" name="LS"/>
          <bitfield caption="Port Power (read/write or read-only)" mask="0x00001000" name="PP"/>
          <bitfield caption="Port Owner (read/write)" mask="0x00002000" name="PO"/>
          <bitfield caption="Port Indicator Control (read/write)" mask="0x0000C000" name="PIC"/>
          <bitfield caption="Port Test Control (read/write)" mask="0x000F0000" name="PTC"/>
          <bitfield caption="Wake on Connect Enable (read/write)" mask="0x00100000" name="WKCNNT_E"/>
          <bitfield caption="Wake on Disconnect Enable (read/write)" mask="0x00200000" name="WKDSCNNT_E"/>
          <bitfield caption="Wake on Over-current Enable (read/write)" mask="0x00400000" name="WKOC_E"/>
        </register>
        <register caption="EHCI Synopsys-Specific Registers 00" name="UHPHS_INSNREG00" offset="0x90" rw="RW" size="4">
          <bitfield caption="Enable this Register" mask="0x00000001" name="En"/>
          <bitfield caption="Microframe Counter with Word Byte Interface" mask="0x00000FFE" name="MFC_16"/>
          <bitfield caption="Microframe Counter with Byte Interface" mask="0x00003000" name="MFC_8"/>
          <bitfield caption="Debug Purposes" mask="0x000FC000" name="Debug"/>
        </register>
        <register caption="EHCI Synopsys-Specific Registers 01" name="UHPHS_INSNREG01" offset="0x94" rw="RW" size="4">
          <bitfield caption="Amount of Data Available in the IN Packet Buffer" mask="0x0000FFFF" name="In_Threshold"/>
          <bitfield caption="Amount of Data Available in the OUT Packet Buffer" mask="0xFFFF0000" name="Out_Threshold"/>
        </register>
        <register caption="EHCI Synopsys-Specific Registers 02" name="UHPHS_INSNREG02" offset="0x98" rw="RW" size="4">
          <bitfield caption="Number of Entries" mask="0x00000FFF" name="Dwords"/>
        </register>
        <register caption="EHCI Synopsys-Specific Registers 03" name="UHPHS_INSNREG03" offset="0x9C" rw="RW" size="4">
          <bitfield caption="Break Memory Transfer (in CONFIG1 mode only, not applicable in CONFIG2 mode)" mask="0x00000001" name="Break_Mem"/>
          <bitfield caption="Time-Available Offset" mask="0x000001FE" name="TA_Offset"/>
          <bitfield caption="Periodic Frame List Fetch" mask="0x00000200" name="Per_Frame"/>
          <bitfield caption="Tx-Tx Turnaround Delay Add-on" mask="0x00001C00" name="T03_Tx"/>
          <bitfield caption="Ignore Linestate During TestSE0 Nak" mask="0x00002000" name="Ignore_LS"/>
          <bitfield caption="Enable 256 Clock Checking" mask="0x00004000" name="EN_CK256"/>
        </register>
        <register caption="EHCI Synopsys-Specific Registers 04" name="UHPHS_INSNREG04" offset="0xA0" rw="RW" size="4">
          <bitfield caption="HCSPARAMS Write" mask="0x00000001" name="HCSPARAMS_W"/>
          <bitfield caption="HCCPARAMS Bits Write" mask="0x00000002" name="HCCPARAMS_BW"/>
          <bitfield caption="Scales Down Port Enumeration Time" mask="0x00000004" name="SDPE_TIME"/>
          <bitfield caption="NAK Reload Fix (Read/Write)" mask="0x00000010" name="NAK_RF"/>
          <bitfield caption="Enable Automatic Feature" mask="0x00000020" name="EN_AutoFunc"/>
        </register>
        <register caption="EHCI Synopsys-Specific Registers 05" name="UHPHS_INSNREG05" offset="0xA4" rw="RW" size="4">
          <bitfield caption="Vendor Status (Software RO)" mask="0x000000FF" name="VStatus"/>
          <bitfield caption="Vendor Control (Software R/W)" mask="0x00000F00" name="VControl"/>
          <bitfield caption="Vendor Control Load Microframe" mask="0x00001000" name="VControlLoadM"/>
          <bitfield caption="Vendor Port (Software R/W)" mask="0x0001E000" name="VPort"/>
          <bitfield caption="Vendor Busy (Software RO)" mask="0x00020000" name="VBusy"/>
        </register>
        <register caption="EHCI Synopsys-Specific Registers 06" name="UHPHS_INSNREG06" offset="0xA8" rw="RW" size="4">
          <bitfield caption="Number of Successful Bursts (read-only)(1)" mask="0x0000000F" name="Nb_Success_Burst"/>
          <bitfield caption="Number of Bursts (read-only)(1)" mask="0x000001F0" name="Nb_Burst"/>
          <bitfield caption="Burst Value (read-only)(1)" mask="0x00000E00" name="HBURST"/>
          <bitfield caption="AHB Error" mask="0x80000000" name="AHB_ERR"/>
        </register>
        <register caption="EHCI Synopsys-Specific Registers 07" name="UHPHS_INSNREG07" offset="0xAC" rw="RW" size="4">
          <bitfield caption="AHB Address (read only)" mask="0xFFFFFFFF" name="AHB_ADDR"/>
        </register>
        <register caption="EHCI Synopsys-Specific Registers 08" name="UHPHS_INSNREG08" offset="0xB0" rw="RW" size="4">
          <bitfield caption="HSIC Enable/Disable" mask="0x00000004" name="HSIC_EN"/>
        </register>
      </register-group>
    </module>
    <module caption="Watchdog Timer" id="6080" name="WDT" version="N">
      <register-group name="WDT">
        <register caption="Control Register" name="WDT_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Watchdog Restart" mask="0x00000001" name="WDRSTT"/>
          <bitfield caption="Lock Mode Register Write Access" mask="0x00000010" name="LOCKMR"/>
          <bitfield caption="Password" mask="0xFF000000" name="KEY" values="WDT_CR__KEY"/>
        </register>
        <register caption="Mode Register" name="WDT_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Watchdog Counter Value" mask="0x00000FFF" name="WDV"/>
          <bitfield caption="Watchdog Fault Interrupt Enable" mask="0x00001000" name="WDFIEN"/>
          <bitfield caption="Watchdog Reset Enable" mask="0x00002000" name="WDRSTEN"/>
          <bitfield caption="Watchdog Disable" mask="0x00008000" name="WDDIS"/>
          <bitfield caption="Watchdog Delta Value" mask="0x0FFF0000" name="WDD"/>
          <bitfield caption="Watchdog Debug Halt" mask="0x10000000" name="WDDBGHLT"/>
          <bitfield caption="Watchdog Idle Halt" mask="0x20000000" name="WDIDLEHLT"/>
        </register>
        <register caption="Status Register" name="WDT_SR" offset="0x08" rw="R" size="4">
          <bitfield caption="Watchdog Underflow (cleared on read)" mask="0x00000001" name="WDUNF"/>
          <bitfield caption="Watchdog Error (cleared on read)" mask="0x00000002" name="WDERR"/>
        </register>
      </register-group>
